learn-spring-web/src/main/resources/loadtest/async-loadtest-spec.yaml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 30
      arrivalRate: 20
      rampTo: 20
      name: Default phase
scenarios:
  - flow:
      - post:
          url: '/api/v1/product/apply'
          headers:
            x-correlation-id: '{{ $randomString() }}'
          json:
            customerEmail: 'test@test.com'
            productId: '1'
          count: 20